export const stations = [
    "高崎", "高崎問屋町", "井野", "新前橋", "前橋", "前橋大島", "駒形", "伊勢崎", "国定", "岩宿", "桐生", "小俣", "山前", "足利", "足利フラワーパーク", "富田", "佐野", "岩舟", "大平下", "栃木", "思川", "小山", 
    "群馬総社", "八木原", "渋川", "金島", "祖母島", "小野上", "小野上温泉", "市城", "中之条", "群馬原町", "郷原", "矢倉", "岩島", "川原湯温泉", "長野原草津口", "群馬大津", "羽根尾", "袋倉", "万座・鹿沢口", "大前",
    "上野", "尾久", "赤羽", "浦和", "さいたま新都心", "大宮", "土呂", "東大宮", "蓮田", "白岡", "新白岡", "久喜", "東鷲宮", "栗橋", "古河", "野木", "間々田", "小金井", "自治医大", "石橋", "雀宮", "宇都宮", "岡本",
    "宝積寺", "氏家", "蒲須坂", "片岡", "矢板", "野崎", "西那須野", "那須塩原", "黒磯",
]
