<template>
  <div>
    <h3>サイト概要</h3>
      <p>
        ラムダ式の簡約を行います．1ステップの簡約ごとに簡約したいRedexを選択できます．
      </p>
    <h3>使い方</h3>
      <p>
        Termと表示された入力フォームに簡約したいラムダ式を入力します．式の記法については「ラムダ式」を参照してください．
        次に，型付きラムダ計算を扱う場合は，型環境（Type Context, Term Context）を入力します．型環境の記法については「型」を参照してください．
      </p>
      <p>
        式と型環境の入力をして実行（実行ボタンまたはCtrl+Enter）すると，Redexの一覧が表示されます．
        簡約したいRedexをクリックすると，選択したRedexのみが簡約された式と，その式に含まれるRedexの一覧が表示されます．
        以降は同様にして簡約を繰り返します．式からRedexがなくなり，正規形となった時点で終了します．
      </p>
    <h3>画面</h3>
      <p>
        画面右にあるアイコン（縦長の画面では右下の青いボタンを押すと表示される）は，クリックすると
        上から「コンソールのクリア」，「クリアした履歴の表示」，「ラムダ式の例の表示」，「変数の設定の表示」，「型チェック」，「簡約の実行」を実行します．
        また，ラムダ式の入力フォームの右に表示されている「Untyped」スイッチは，
        切り替えることで型無しのラムダ式を受け付けるようになります．
      </p>
      <div><v-icon>mdi-delete</v-icon> <b>コンソールのクリア</b></div>
      <p>
        ラムダ式，型環境，簡約過程などが入力されているコンソールの内容を消去します．
        消去された内容は「<v-icon>mdi-history</v-icon> <b>クリアした履歴の表示</b>」に保持されます．
      </p>
      <div><v-icon>mdi-history</v-icon> <b>簡約の履歴の表示</b></div>
      <p>
        クリアされたコンソールの内容が表示されます．履歴ごとに内容をテキストファイルに保存することもできます．
      </p>
      <div><v-icon>mdi-alpha-e-box</v-icon> <b>ラムダ式の例の表示</b></div>
      <p>
        ラムダ式と型環境の例が一覧されます．クリックすることでその式の簡約が実行されます．
        型付きと型無しの例のそれぞれを，タブを切り替えることで選ぶことが出来ます．
      </p>
      <div><v-icon>mdi-order-alphabetical-ascending</v-icon> <b>変数の設定の表示</b></div>
      <p>
        入力フォーム中で${x}のようにして記述できる変数の設定を行うドロワーが表示されます．
      </p>
      <div><v-icon>mdi-check</v-icon> <b>型チェック</b></div>
      <p>
        入力されたラムダ式の型をチェックします．
      </p>
      <div><v-icon>mdi-play</v-icon> <b>簡約の実行</b></div>
      <p>
        簡約を実行します．Ctrl＋Enterでも同様の動作をします．
      </p>
    <h3>α変換</h3>
      <p>
        自由変数の捕捉が起こる場合，対応する束縛変数の名前が変更されるα変換が起こります．
        α変換が行われたとき，名前がどう変更されたのか，下線が引かれた状態で表示されます．
        次の例は，α変換により束縛変数 <kbd>x</kbd> が <kbd>y</kbd> にリネームされたことを示しています．
        <br><br>
        - 例<br>
        <kbd><u>α: x -> y</u></kbd>
      </p>
  </div>
</template>
